pr10/re100/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forces
{
        type            forces;
        libs            ("libforces.so");
        outputControl    timeStep;
        outputInterval   4;
       
        patches         ("cylinder");
        rho             rhoInf;
        log             true;
        rhoInf          1.225;
        pName           p;
        UName           U;

        liftDir         (0 1 0);
        dragDir         (1 0 0);
        CofR            (0 0 0);
        pitchAxis       (0 0 1);
        magUInf         1.;
        lRef            1.;
        Aref            0.5;
}

forceCoeffs
{
    type            forceCoeffs;
    libs            ("libforces.so");
    outputControl    timeStep;
    outputInterval   4;

    patches         ("cylinder");
    rho             rhoInf;      // Indicates incompressible
    log             true;
    rhoInf          1.225;           // Redundant for incompressible
    pName           p;
    UName           U;
    
    liftDir         (0 1 0);
    dragDir         (1 0 0);
    CofR            (0 0 0);  // Axle midpoint on ground
    pitchAxis       (0 0 1);
    magUInf         1.;
    lRef            1.;        // Wheelbase length
    Aref            0.5;        // Estimated
}


// ************************************************************************* //
